{
    "class_name": "Model",
    "config":
    {
        "name": "mask_rcnn",
        "layers":
        [
            {
                "name": "input_image",
                "class_name": "InputLayer",
                "config":
                {
                    "batch_input_shape":
                    [
                        null,
                        null,
                        null,
                        3
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "name": "input_image"
                },
                "inbound_nodes":
                []
            },
            {
                "name": "zero_padding2d_1",
                "class_name": "ZeroPadding2D",
                "config":
                {
                    "name": "zero_padding2d_1",
                    "trainable": true,
                    "padding":
                    [
                        [
                            3,
                            3
                        ],
                        [
                            3,
                            3
                        ]
                    ],
                    "data_format": "channels_last"
                },
                "inbound_nodes":
                [
                    [
                        [
                            "input_image",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv1",
                "class_name": "Conv2D",
                "config":
                {
                    "name": "conv1",
                    "trainable": true,
                    "filters": 64,
                    "kernel_size":
                    [
                        7,
                        7
                    ],
                    "strides":
                    [
                        2,
                        2
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate":
                    [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer":
                    {
                        "class_name": "VarianceScaling",
                        "config":
                        {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer":
                    {
                        "class_name": "Zeros",
                        "config":
                        {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes":
                [
                    [
                        [
                            "zero_padding2d_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "bn_conv1",
                "class_name": "BatchNorm",
                "config":
                {
                    "name": "bn_conv1",
                    "trainable": true,
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer":
                    {
                        "class_name": "Zeros",
                        "config":
                        {}
                    },
                    "gamma_initializer":
                    {
                        "class_name": "Ones",
                        "config":
                        {}
                    },
                    "moving_mean_initializer":
                    {
                        "class_name": "Zeros",
                        "config":
                        {}
                    },
                    "moving_variance_initializer":
                    {
                        "class_name": "Ones",
                        "config":
                        {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes":
                [
                    [
                        [
                            "conv1",
                            0,
                            0,
                            {
                                "training": false
                            }
                        ]
                    ]
                ]
            },
            {
                "name": "activation_1",
                "class_name": "Activation",
                "config":
                {
                    "name": "activation_1",
                    "trainable": true,
                    "activation": "relu"
                },
                "inbound_nodes":
                [
                    [
                        [
                            "bn_conv1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "max_pooling2d_1",
                "class_name": "MaxPooling2D",
                "config":
                {
                    "name": "max_pooling2d_1",
                    "trainable": true,
                    "pool_size":
                    [
                        3,
                        3
                    ],
                    "padding": "same",
                    "strides":
                    [
                        2,
                        2
                    ],
                    "data_format": "channels_last"
                },
                "inbound_nodes":
                [
                    [
                        [
                            "activation_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "res2a_branch2a",
                "class_name": "Conv2D",
                "config":
                {
                    "name": "res2a_branch2a",
                    "trainable": true,
                    "filters": 64,
                    "kernel_size":
                    [
                        1,
                        1
                    ],
                    "strides":
                    [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate":
                    [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer":
                    {
                        "class_name": "VarianceScaling",
                        "config":
                        {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer":
                    {
                        "class_name": "Zeros",
                        "config":
                        {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes":
                [
                    [
                        [
                            "max_pooling2d_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "bn2a_branch2a",
                "class_name": "BatchNorm",
                "config":
                {
                    "name": "bn2a_branch2a",
                    "trainable": true,
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer":
                    {
                        "class_name": "Zeros",
                        "config":
                        {}
                    },
                    "gamma_initializer":
                    {
                        "class_name": "Ones",
                        "config":
                        {}
                    },
                    "moving_mean_initializer":
                    {
                        "class_name": "Zeros",
                        "config":
                        {}
                    },
                    "moving_variance_initializer":
                    {
                        "class_name": "Ones",
                        "config":
                        {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes":
                [
                    [
                        [
                            "res2a_branch2a",
                            0,
                            0,
                            {
                                "training": false
                            }
                        ]
                    ]
                ]
            },
            {
                "name": "activation_2",
                "class_name": "Activation",
                "config":
                {
                    "name": "activation_2",
                    "trainable": true,
                    "activation": "relu"
                },
                "inbound_nodes":
                [
                    [
                        [
                            "bn2a_branch2a",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "res2a_branch2b",
                "class_name": "Conv2D",
                "config":
                {
                    "name": "res2a_branch2b",
                    "trainable": true,
                    "filters": 64,
                    "kernel_size":
                    [
                        3,
                        3
                    ],
                    "strides":
                    [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate":
                    [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer":
                    {
                        "class_name": "VarianceScaling",
                        "config":
                        {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer":
                    {
                        "class_name": "Zeros",
                        "config":
                        {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes":
                [
                    [
                        [
                            "activation_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "bn2a_branch2b",
                "class_name": "BatchNorm",
                "config":
                {
                    "name": "bn2a_branch2b",
                    "trainable": true,
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer":
                    {
                        "class_name": "Zeros",
                        "config":
                        {}
                    },
                    "gamma_initializer":
                    {
                        "class_name": "Ones",
                        "config":
                        {}
                    },
                    "moving_mean_initializer":
                    {
                        "class_name": "Zeros",
                        "config":
                        {}
                    },
                    "moving_variance_initializer":
                    {
                        "class_name": "Ones",
                        "config":
                        {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes":
                [
                    [
                        [
                            "res2a_branch2b",
                            0,
                            0,
                            {
                                "training": false
                            }
                        ]
                    ]
                ]
            },
            {
                "name": "activation_3",
                "class_name": "Activation",
                "config":
                {
                    "name": "activation_3",
                    "trainable": true,
                    "activation": "relu"
                },
                "inbound_nodes":
                [
                    [
                        [
                            "bn2a_branch2b",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "res2a_branch2c",
                "class_name": "Conv2D",
                "config":
                {
                    "name": "res2a_branch2c",
                    "trainable": true,
                    "filters": 256,
                    "kernel_size":
                    [
                        1,
                        1
                    ],
                    "strides":
                    [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate":
                    [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer":
                    {
                        "class_name": "VarianceScaling",
                        "config":
                        {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer":
                    {
                        "class_name": "Zeros",
                        "config":
                        {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes":
                [
                    [
                        [
                            "activation_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "res2a_branch1",
                "class_name": "Conv2D",
                "config":
                {
                    "name": "res2a_branch1",
                    "trainable": true,
                    "filters": 256,
                    "kernel_size":
                    [
                        1,
                        1
                    ],
                    "strides":
                    [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate":
                    [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer":
                    {
                        "class_name": "VarianceScaling",
                        "config":
                        {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer":
                    {
                        "class_name": "Zeros",
                        "config":
                        {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes":
                [
                    [
                        [
                            "max_pooling2d_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "bn2a_branch2c",
                "class_name": "BatchNorm",
                "config":
                {
                    "name": "bn2a_branch2c",
                    "trainable": true,
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer":
                    {
                        "class_name": "Zeros",
                        "config":
                        {}
                    },
                    "gamma_initializer":
                    {
                        "class_name": "Ones",
                        "config":
                        {}
                    },
                    "moving_mean_initializer":
                    {
                        "class_name": "Zeros",
                        "config":
                        {}
                    },
                    "moving_variance_initializer":
                    {
                        "class_name": "Ones",
                        "config":
                        {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes":
                [
                    [
                        [
                            "res2a_branch2c",
                            0,
                            0,
                            {
                                "training": false
                            }
                        ]
                    ]
                ]
            },
            {
                "name": "bn2a_branch1",
                "class_name": "BatchNorm",
                "config":
                {
                    "name": "bn2a_branch1",
                    "trainable": true,
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer":
                    {
                        "class_name": "Zeros",
                        "config":
                        {}
                    },
                    "gamma_initializer":
                    {
                        "class_name": "Ones",
                        "config":
                        {}
                    },
                    "moving_mean_initializer":
                    {
                        "class_name": "Zeros",
                        "config":
                        {}
                    },
                    "moving_variance_initializer":
                    {
                        "class_name": "Ones",
                        "config":
                        {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes":
                [
                    [
                        [
                            "res2a_branch1",
                            0,
                            0,
                            {
                                "training": false
                            }
                        ]
                    ]
                ]
            },
            {
                "name": "add_1",
                "class_name": "Add",
                "config":
                {
                    "name": "add_1",
                    "trainable": true
                },
                "inbound_nodes":
                [
                    [
                        [
                            "bn2a_branch2c",
                            0,
                            0,
                            {}
                        ],
                        [
                            "bn2a_branch1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "res2a_out",
                "class_name": "Activation",
                "config":
                {
                    "name": "res2a_out",
                    "trainable": true,
                    "activation": "relu"
                },
                "inbound_nodes":
                [
                    [
                        [
                            "add_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "res2b_branch2a",
                "class_name": "Conv2D",
                "config":
                {
                    "name": "res2b_branch2a",
                    "trainable": true,
                    "filters": 64,
                    "kernel_size":
                    [
                        1,
                        1
                    ],
                    "strides":
                    [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate":
                    [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer":
                    {
                        "class_name": "VarianceScaling",
                        "config":
                        {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer":
                    {
                        "class_name": "Zeros",
                        "config":
                        {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes":
                [
                    [
                        [
                            "res2a_out",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "bn2b_branch2a",
                "class_name": "BatchNorm",
                "config":
                {
                    "name": "bn2b_branch2a",
                    "trainable": true,
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer":
                    {
                        "class_name": "Zeros",
                        "config":
                        {}
                    },
                    "gamma_initializer":
                    {
                        "class_name": "Ones",
                        "config":
                        {}
                    },
                    "moving_mean_initializer":
                    {
                        "class_name": "Zeros",
                        "config":
                        {}
                    },
                    "moving_variance_initializer":
                    {
                        "class_name": "Ones",
                        "config":
                        {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes":
                [
                    [
                        [
                            "res2b_branch2a",
                            0,
                            0,
                            {
                                "training": false
                            }
                        ]
                    ]
                ]
            },
            {
                "name": "activation_4",
                "class_name": "Activation",
                "config":
                {
                    "name": "activation_4",
                    "trainable": true,
                    "activation": "relu"
                },
                "inbound_nodes":
                [
                    [
                        [
                            "bn2b_branch2a",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "res2b_branch2b",
                "class_name": "Conv2D",
                "config":
                {
                    "name": "res2b_branch2b",
                    "trainable": true,
                    "filters": 64,
                    "kernel_size":
                    [
                        3,
                        3
                    ],
                    "strides":
                    [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate":
                    [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer":
                    {
                        "class_name": "VarianceScaling",
                        "config":
                        {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer":
                    {
                        "class_name": "Zeros",
                        "config":
                        {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes":
                [
                    [
                        [
                            "activation_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "bn2b_branch2b",
                "class_name": "BatchNorm",
                "config":
                {
                    "name": "bn2b_branch2b",
                    "trainable": true,
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer":
                    {
                        "class_name": "Zeros",
                        "config":
                        {}
                    },
                    "gamma_initializer":
                    {
                        "class_name": "Ones",
                        "config":
                        {}
                    },
                    "moving_mean_initializer":
                    {
                        "class_name": "Zeros",
                        "config":
                        {}
                    },
                    "moving_variance_initializer":
                    {
                        "class_name": "Ones",
                        "config":
                        {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes":
                [
                    [
                        [
                            "res2b_branch2b",
                            0,
                            0,
                            {
                                "training": false
                            }
                        ]
                    ]
                ]
            },
            {
                "name": "activation_5",
                "class_name": "Activation",
                "config":
                {
                    "name": "activation_5",
                    "trainable": true,
                    "activation": "relu"
                },
                "inbound_nodes":
                [
                    [
                        [
                            "bn2b_branch2b",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "res2b_branch2c",
                "class_name": "Conv2D",
                "config":
                {
                    "name": "res2b_branch2c",
                    "trainable": true,
                    "filters": 256,
                    "kernel_size":
                    [
                        1,
                        1
                    ],
                    "strides":
                    [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate":
                    [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer":
                    {
                        "class_name": "VarianceScaling",
                        "config":
                        {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer":
                    {
                        "class_name": "Zeros",
                        "config":
                        {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes":
                [
                    [
                        [
                            "activation_5",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "bn2b_branch2c",
                "class_name": "BatchNorm",
                "config":
                {
                    "name": "bn2b_branch2c",
                    "trainable": true,
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer":
                    {
                        "class_name": "Zeros",
                        "config":
                        {}
                    },
                    "gamma_initializer":
                    {
                        "class_name": "Ones",
                        "config":
                        {}
                    },
                    "moving_mean_initializer":
                    {
                        "class_name": "Zeros",
                        "config":
                        {}
                    },
                    "moving_variance_initializer":
                    {
                        "class_name": "Ones",
                        "config":
                        {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes":
                [
                    [
                        [
                            "res2b_branch2c",
                            0,
                            0,
                            {
                                "training": false
                            }
                        ]
                    ]
                ]
            },
            {
                "name": "add_2",
                "class_name": "Add",
                "config":
                {
                    "name": "add_2",
                    "trainable": true
                },
                "inbound_nodes":
                [
                    [
                        [
                            "bn2b_branch2c",
                            0,
                            0,
                            {}
                        ],
                        [
                            "res2a_out",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "res2b_out",
                "class_name": "Activation",
                "config":
                {
                    "name": "res2b_out",
                    "trainable": true,
                    "activation": "relu"
                },
                "inbound_nodes":
                [
                    [
                        [
                            "add_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "res2c_branch2a",
                "class_name": "Conv2D",
                "config":
                {
                    "name": "res2c_branch2a",
                    "trainable": true,
                    "filters": 64,
                    "kernel_size":
                    [
                        1,
                        1
                    ],
                    "strides":
                    [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate":
                    [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer":
                    {
                        "class_name": "VarianceScaling",
                        "config":
                        {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer":
                    {
                        "class_name": "Zeros",
                        "config":
                        {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes":
                [
                    [
                        [
                            "res2b_out",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "bn2c_branch2a",
                "class_name": "BatchNorm",
                "config":
                {
                    "name": "bn2c_branch2a",
                    "trainable": true,
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer":
                    {
                        "class_name": "Zeros",
                        "config":
                        {}
                    },
                    "gamma_initializer":
                    {
                        "class_name": "Ones",
                        "config":
                        {}
                    },
                    "moving_mean_initializer":
                    {
                        "class_name": "Zeros",
                        "config":
                        {}
                    },
                    "moving_variance_initializer":
                    {
                        "class_name": "Ones",
                        "config":
                        {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes":
                [
                    [
                        [
                            "res2c_branch2a",
                            0,
                            0,
                            {
                                "training": false
                            }
                        ]
                    ]
                ]
            },
            {
                "name": "activation_6",
                "class_name": "Activation",
                "config":
                {
                    "name": "activation_6",
                    "trainable": true,
                    "activation": "relu"
                },
                "inbound_nodes":
                [
                    [
                        [
                            "bn2c_branch2a",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "res2c_branch2b",
                "class_name": "Conv2D",
                "config":
                {
                    "name": "res2c_branch2b",
                    "trainable": true,
                    "filters": 64,
                    "kernel_size":
                    [
                        3,
                        3
                    ],
                    "strides":
                    [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate":
                    [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer":
                    {
                        "class_name": "VarianceScaling",
                        "config":
                        {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer":
                    {
                        "class_name": "Zeros",
                        "config":
                        {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes":
                [
                    [
                        [
                            "activation_6",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "bn2c_branch2b",
                "class_name": "BatchNorm",
                "config":
                {
                    "name": "bn2c_branch2b",
                    "trainable": true,
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer":
                    {
                        "class_name": "Zeros",
                        "config":
                        {}
                    },
                    "gamma_initializer":
                    {
                        "class_name": "Ones",
                        "config":
                        {}
                    },
                    "moving_mean_initializer":
                    {
                        "class_name": "Zeros",
                        "config":
                        {}
                    },
                    "moving_variance_initializer":
                    {
                        "class_name": "Ones",
                        "config":
                        {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes":
                [
                    [
                        [
                            "res2c_branch2b",
                            0,
                            0,
                            {
                                "training": false
                            }
                        ]
                    ]
                ]
            },
            {
                "name": "activation_7",
                "class_name": "Activation",
                "config":
                {
                    "name": "activation_7",
                    "trainable": true,
                    "activation": "relu"
                },
                "inbound_nodes":
                [
                    [
                        [
                            "bn2c_branch2b",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "res2c_branch2c",
                "class_name": "Conv2D",
                "config":
                {
                    "name": "res2c_branch2c",
                    "trainable": true,
                    "filters": 256,
                    "kernel_size":
                    [
                        1,
                        1
                    ],
                    "strides":
                    [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate":
                    [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer":
                    {
                        "class_name": "VarianceScaling",
                        "config":
                        {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer":
                    {
                        "class_name": "Zeros",
                        "config":
                        {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes":
                [
                    [
                        [
                            "activation_7",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "bn2c_branch2c",
                "class_name": "BatchNorm",
                "config":
                {
                    "name": "bn2c_branch2c",
                    "trainable": true,
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer":
                    {
                        "class_name": "Zeros",
                        "config":
                        {}
                    },
